In [6]:
import pandas as pd
import sqlite3
import seaborn as sb
import matplotlib as plt

In [7]:
# SQLite database passage
conn = sqlite3.connect('space_missions.sqlite')
cur = conn.cursor()

tablename = 'records'

df = pd.read_csv('space_missions_normalized.csv')
df.to_sql(tablename, conn, if_exists='replace', index=False)

4630

In [8]:
# First analysis query
# List of companies per country
q = '''
SELECT Country, COUNT(DISTINCT Company) AS TotalCompaniesPerCountry
FROM records
GROUP BY Country
ORDER BY TotalCompaniesPerCountry DESC;
'''
# pd.read_sql_query(q,conn)
pd.read_sql_query(q,conn)

                           Country  TotalCompaniesPerCountry
0                              USA                        19
1                       Kazakhstan                        11
2                           Russia                         9
3                            China                         8
4                           France                         5
5                            Japan                         4
6                        Australia                         3
7                             Iran                         2
8                       Yellow Sea                         1
9                      South Korea                         1
10       Shahrud Missile Test Site                         1
11                   Pacific Ocean                         1
12  Pacific Missile Range Facility                         1
13                     North Korea                         1
14                     New Zealand                         1
15                      New Mexico                         1
16                           Kenya                         1
17                          Israel                         1
18                           India                         1
19                    Gran Canaria                         1
20                          Brazil                         1
21                     Barents Sea                         1

In [9]:
# Creating a new database to save the insights
conn2 = sqlite3.connect('space_missions_insights.sqlite') 
cur = conn.cursor()

NtableName = 'companies_country'
df2 = pd.read_sql_query(q,conn)
df2.to_sql(NtableName, conn2, if_exists='replace', index=False)

22

In [13]:
# Top 5 countries with rocket launches
q2 = '''
SELECT Country, COUNT(*) AS TotalLaunches
FROM records
GROUP BY Country
ORDER BY TotalLaunches DESC
LIMIT 5;
'''
NtableName2='total_launches'
df3 = pd.read_sql_query(q2, conn)
df3.to_sql(NtableName2, conn2, if_exists='replace', index=False)


print(df3)

      Country  TotalLaunches
0         USA           1467
1      Russia           1416
2  Kazakhstan            719
3       China            365
4      France            318

In [26]:
# Top 3 with success launches
q3 = '''
SELECT Country, COUNT(*) AS SuccesfullLaunches
FROM records
WHERE MissionStatus = 'Success'
GROUP BY Country
ORDER BY SuccesfullLaunches DESC
LIMIT 3;
'''
NtableName3 = 'top_suc-mission'
df4 = pd.read_sql_query(q3, conn)
df4.to_sql(NtableName3, conn2, if_exists='replace', index=False)

print(df4)

      Country  SuccesfullLaunches
0      Russia                1323
1         USA                1298
2  Kazakhstan                 625

In [25]:
q4 = '''
SELECT Country, COUNT(*) AS UnsuccesfullLaunches
FROM records
WHERE MissionStatus = 'Failure' OR MissionStatus = 'PartialFailure'
GROUP BY Country
ORDER BY UnsuccesfullLaunches DESC
LIMIT 3;
'''
NtableName3 = 'top_uns-mission'
df5 = pd.read_sql_query(q4, conn)
df5.to_sql(NtableName3, conn2, if_exists='replace', index=False)

print(df5)

      Country  UnsuccesfullLaunches
0         USA                   134
1  Kazakhstan                    72
2      Russia                    63